# SurfaceArea Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..SurfaceArea Property
ParameterTypeId Class See Also
---
"Surface Area"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId SurfaceArea { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SurfaceArea As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SurfaceArea {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace